jiekou/yii/frontend/controllers/ArriveController.php

INSERT INTO `arrive` (`jiaotong`, `jiezhan`, `bagintime`, `endtime`, `is_pei`, `pei_num`) VALUES ('', 'dsf', '234', '234', '', 234324)
---
    public function actionJson()
    {
        $callback = Yii::$app->request->get('callback');
        $jiaotong = Yii::$app->request->post('transportation');
        $jiezhan = Yii::$app->request->post('cityUrl');
        $bagintime = Yii::$app->request->post('goTime');
        $endtime = Yii::$app->request->post('atTime');
        $is_pei = Yii::$app->request->post('isEscort');
        $pei_num = Yii::$app->request->post('ecortNum');
        $data = Yii::$app->db->createCommand()->insert('arrive', [
            'jiaotong' => $jiaotong,
            'jiezhan' => $jiezhan,
            'bagintime' => $bagintime,
            'endtime' => $endtime,
            'is_pei' => $is_pei,
            'pei_num' => $pei_num,
        ])->execute();