jiekou/yii/frontend/controllers/MyanswerController.php

	public function actionSel()
	{
		$data = (new \yii\db\Query())
        ->from('question')
        ->all();
---
SELECT * FROM `question`